gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
// Boîtier de contrôle pour le ksoloti
// Ce boîtier envoie des données DMX vers le récepteur ksoloti
// Il gère les capteurs Sharp IR, les faders, les boutons et l'encodeur rotatif
// Il gère également l'affichage sur l'écran TM1637
// Il gère également le ruban WS2812B
// L'Onirigun est maintenant géré par le récepteur Ksoloti
// Il gère également le dimmer RGB
// Il gère également la transposition du pitch
// Il gère également les presets
// Il communique avec le récepteur ksoloti via ESP-NOW 

// adresse mac de l'onirigun : 68:C6:3A:FD:37:17 (géré par le récepteur Ksoloti)

#define VERSION 165 // l'onirigun est pris en charge par le récepteur ksoloti
/*
// Contrôleur interactif ESP32 avec capteurs Sharp IR
// Utilise ESP-NOW pour transmettre les données DMX
// Fréquence d'émission : 50Hz
// Canal DMX 102 : valeur du capteur Sharp IR (0-255)
*/

#include <Arduino.h>
#include <esp_now.h>
#include <WiFi.h>
#include <ESP32Encoder.h>
#include <Wire.h>
#include <TM1637Display.h>
#include <driver/adc.h>  // Pour les constantes ADC de l'ESP32
#include <FastLED.h>     // Pour le ruban WS2812B
#include <WebServer.h>   // Pour le serveur web
#include <LittleFS.h>    // Pour le système de fichiers
#include <ArduinoJson.h> // Pour le format JSON

#define CONTROL_TEST 0 // 1 pour tester les entrées, 0 pour le fonctionnement normal

// Définitions pour les capteurs Sharp IR
#define DIST_SENSOR_1_PIN 35    // GPIO35 - Premier capteur Sharp IR (changé pour plus de stabilité)
#define DIST_SENSOR_2_PIN 36    // GPIO36 - Deuxième capteur Sharp IR

// Définitions pour les faders analogiques
#define FADER_1_PIN 32    // GPIO32 - Premier fader
#define FADER_2_PIN 33    // GPIO33 - Deuxième fader (changé pour éviter le conflit)
#define FADER_3_PIN 34    // GPIO34 - Troisième fader

// Définitions pour l'encodeur rotatif KY-040
#define ENCODER_A_PIN 26    // GPIO26 - Pin A de l'encodeur
#define ENCODER_B_PIN 27    // GPIO27 - Pin B de l'encodeur
#define ENCODER_BUTTON_PIN 25  // GPIO25 - Bouton de l'encodeur

// Définitions pour l'afficheur TM1637
#define TM1637_CLK_PIN 18    // GPIO18 - CLK de l'afficheur
#define TM1637_DIO_PIN 19    // GPIO19 - DIO de l'afficheur

// Définitions pour les boutons push (remplacement du PCF8574)
#define BUTTON_1_PIN 22    // GPIO22 - Premier bouton (libéré du PCF8574)
#define BUTTON_2_PIN 21    // GPIO21 - Deuxième bouton (libéré du PCF8574)
#define BUTTON_3_PIN 23    // GPIO23 - Troisième bouton (nouveau GPIO)

// Définitions pour le ruban WS2812B
#define LED_STRIP_PIN 4    // GPIO4 - Signal DATA du WS2812B
#define NUM_LEDS 144         // Nombre de LEDs dans le ruban (ajustable)
#define BRIGHTNESS 64      // Luminosité (0-255)

// Configuration ESP-NOW
#define EMISSION_FREQUENCY 50  // Hz (20ms entre chaque émission)
#define DMX_CHANNEL_IR_1 102  // Canal DMX pour le premier capteur Sharp IR
#define DMX_CHANNEL_IR_2 103  // Canal DMX pour le deuxième capteur Sharp IR
#define MAX_DISTANCE_CM 80  // Distance maximale en cm pour Sharp IR (80cm = 0, 4cm = 255)
#define MIN_DISTANCE_CM 4   // Distance minimale en cm pour Sharp IR

// Configuration des presets
#define PRESET_SIZE 40  // Nombre de paramètres par preset (40 au lieu de 38)
#define MAX_PRESETS 10  // Nombre maximum de presets
#define MAX_WEB_PRESETS 5  // Nombre maximum de presets web

// Configuration des trigs
#define TRIG_LENGTH 5   // Durée des trigs en nombre de paquets DMX

// Configuration du dimmer RGB
#define DIMMER_SPEED 0.01 // Vitesse de l'inertie du dimmer (0.0-1.0, plus petit = plus lent)

// Configuration du serveur web
#define WEB_SERVER_PORT 80
#define AP_SSID "Ksoloti Kontrol"
#define AP_PASSWORD "ksoloti123"

// Structure pour un paramètre
typedef struct {
  const char* name;     // Nom du paramètre
  uint16_t dmxChannel;  // Canal DMX (1-512)
  uint8_t value;        // Valeur actuelle (0-255)
  uint8_t defaultValue; // Valeur par défaut
} Parameter;

// Structure pour un preset complet
typedef struct {
  char name[16];        // Nom du preset
  uint8_t values[PRESET_SIZE]; // Valeurs des paramètres
} Preset;

// Structure pour un preset web
typedef struct {
  char name[32];
  uint8_t values[21];  // 21 paramètres audio principaux (0-20)
} WebPreset;

// ============================================================================
// DÉCLARATIONS DES FONCTIONS DE L'INTERFACE WEB
// ============================================================================

// Fonctions de l'interface web
void setupWebInterface();
void setupWebRoutes();

void handleGetParameters();
void handleUpdateParameter();
void handleGetAssignments();
void handleUpdateAssignments();
void handleSaveWebPreset();
void handleLoadWebPreset();
void handleListWebPresets();
void handleOctave();
void handleNotFound();
void saveWebPresets();
void loadWebPresets();
void saveWebAssignments();
void loadWebAssignments();
void saveWebStateToPreset0();
void loadWebStateFromPreset0();
void saveWebStateToPreset0();
void resetWebParameters();
void handleWebPhysicalControls();

// Création des objets
TM1637Display display(TM1637_CLK_PIN, TM1637_DIO_PIN);
ESP32Encoder encoder;

// Objets pour l'interface web
WebServer webServer(WEB_SERVER_PORT);

// Variables pour l'interface web
bool webModeActive = false;           // True si le preset 0 (web) est actif
uint8_t webAssignments[4] = {0, 0, 0, 0}; // IR1, IR2, Fader2, Fader3 (0 = OFF, 1-21 = paramètre)
uint8_t lastWebPreset = 0;            // Dernier preset web chargé
uint8_t webPresetCount = 0;           // Nombre de presets web sauvegardés
int8_t webOctave = 0;                 // Octave web (indépendante de la transposition)

WebPreset webPresets[MAX_WEB_PRESETS];

// Définition du tableau de LEDs pour FastLED
CRGB leds[NUM_LEDS];

// Définition des 37 paramètres du theremin (24 existants + 13 nouveaux)
Parameter parameters[PRESET_SIZE] = {
  // Paramètres existants (1-24)
  {"autopan_depth", 101, 0, 0},
  {"pitch", 102, 0, 0},
  {"vibrato_speed", 103, 0, 0},
  {"vibrato_depth", 104, 0, 0},
  {"delay_time", 105, 0, 0},
  {"delay_feedback", 106, 0, 0},
  {"osc_waveform", 107, 0, 0},
  {"gate_threshold", 108, 0, 0},
  {"portamento_time", 109, 0, 0},
  {"scale", 110, 0, 0},
  {"octave_low_high", 111, 0, 0},
  {"osc2_volume", 112, 0, 0},
  {"osc2_pitch_offset", 113, 0, 0},
  {"autopan_frequency", 114, 0, 0},
  {"scale_tonic", 115, 0, 0},
  {"volume_drums", 116, 0, 0},
  {"trig_kick", 117, 0, 0},
  {"trig_snare", 118, 0, 0},
  {"trig_hh", 119, 0, 0},
  {"master_volume", 120, 0, 0},
  {"filter_on_off", 121, 0, 0},
  {"filter_cutoff", 122, 0, 0},
  {"filter_reso", 123, 0, 0},
  {"filter_type", 124, 0, 0},
  
  // Nouveaux paramètres (25-37)
  {"ir1_target_param", 125, 1, 1},        // 1 - index du paramètre contrôlé par IR1 (1 = pitch)
  {"ir2_target_param", 126, 3, 3},        // 2 - index du paramètre contrôlé par IR2 (3 = vibrato_depth)
  {"fader1_target_param", 127, 2, 2},     // 3 - index du paramètre contrôlé par fader1 (2 = vibrato_speed)
  {"fader2_target_param", 128, 4, 4},     // 4 - index du paramètre contrôlé par fader2 (4 = delay_time)
  {"fader3_target_param", 129, 5, 5},     // 5 - index du paramètre contrôlé par fader3 (5 = delay_feedback)
  {"button3_target_param", 130, 18, 18},  // 6 - index du paramètre contrôlé par bouton3 (18 = trig_hh)
  {"button3_released_value", 131, 0, 0},  // 7 - valeur quand bouton3 est relevé
  {"button3_pressed_value", 132, 5, 5},   // 8 - valeur quand bouton3 est pressé
  {"rgb1_red", 133, 255, 255},            // 9 - première valeur RGB (rouge)
  {"rgb1_green", 134, 0, 0},              // 10 - première valeur RGB (vert)
  {"rgb1_blue", 135, 0, 0},               // 11 - première valeur RGB (bleu)
  {"rgb2_red", 136, 0, 0},                // 12 - deuxième valeur RGB (rouge)
  {"rgb2_green", 137, 255, 255},          // 13 - deuxième valeur RGB (vert)
  {"rgb2_blue", 138, 0, 0},               // 14 - deuxième valeur RGB (bleu)
  {"dimmer1_source", 139, 0, 0},          // 15 - source du dimmer1 (0=IR1, 1=IR2, 2=Fader1, 3=Fader2, 4=Fader3)
  {"dimmer2_source", 140, 1, 1}           // 16 - source du dimmer2 (0=IR1, 1=IR2, 2=Fader1, 3=Fader2, 4=Fader3)
};

