gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
// Configuration des routes du serveur web
void setupWebRoutes() {
  // Redirection automatique de la racine vers index.html
  webServer.on("/", HTTP_GET, []() {
    webServer.sendHeader("Location", "/index.html", true);
    webServer.send(302, "text/plain", "Redirection vers l'interface web...");
  });
  
  // Route de test simple (pour vérifier que le serveur fonctionne)
  webServer.on("/test", HTTP_GET, []() {
    String html = "<!DOCTYPE html><html><body>";
    html += "<h1>Test DMX Controller</h1>";
    html += "<p>Le serveur web fonctionne !</p>";
    html += "<p>Fichiers LittleFS:</p><ul>";
    
    File root = LittleFS.open("/");
    File file = root.openNextFile();
    while (file) {
      html += "<li>" + String(file.name()) + " (" + String(file.size()) + " bytes)</li>";
      file = root.openNextFile();
    }
    html += "</ul>";

    html += "</body></html>";
    
    webServer.send(200, "text/html", html);
  });
  

  
  // Servir les fichiers statiques depuis LittleFS
  webServer.serveStatic("/", LittleFS, "/");
  
  // API pour récupérer les paramètres
  webServer.on("/api/parameters", HTTP_GET, handleGetParameters);
  
  // API pour mettre à jour un paramètre
  webServer.on("/api/parameters", HTTP_POST, handleUpdateParameter);
  
  // API pour récupérer les assignations
  webServer.on("/api/assignments", HTTP_GET, handleGetAssignments);
  
  // API pour mettre à jour les assignations
  webServer.on("/api/assignments", HTTP_POST, handleUpdateAssignments);
  
  // API pour sauvegarder un preset web
  webServer.on("/api/save-preset", HTTP_POST, handleSaveWebPreset);
  
  // API pour charger un preset web
  webServer.on("/api/load-preset", HTTP_POST, handleLoadWebPreset);
  
  // API pour lister les presets web
  webServer.on("/api/presets", HTTP_GET, handleListWebPresets);
  
  // API pour gérer les octaves
  webServer.on("/api/octave", HTTP_POST, handleOctave);
  
  // Gestion des erreurs 404
  webServer.onNotFound(handleNotFound);
}



// API: Récupérer les paramètres
void handleGetParameters() {
  Serial.println("📊 GET /api/parameters - Début");
  
  DynamicJsonDocument doc(1024);
  JsonArray paramsArray = doc.createNestedArray("parameters");
  
  // Envoyer les 21 paramètres audio principaux (0-20)
  // Si on est en mode web (preset 0), utiliser les valeurs des paramètres
  // Sinon, utiliser les valeurs du preset actuel
  if (selectedPreset == 0) {
    for (int i = 0; i < 21; i++) {
      paramsArray.add(parameters[i].value);
    }
  } else {
    for (int i = 0; i < 21; i++) {
      paramsArray.add(presets[selectedPreset].values[i]);
    }
  }
  
  String response;
  serializeJson(doc, response);
  
  Serial.println("📊 GET /api/parameters - Réponse envoyée: " + response);
  webServer.send(200, "application/json", response);
}

// API: Mettre à jour un paramètre
void handleUpdateParameter() {
  if (webServer.hasArg("plain")) {
    DynamicJsonDocument doc(512);
    deserializeJson(doc, webServer.arg("plain"));
    
    int id = doc["id"];
    int value = doc["value"];
    
    if (id >= 0 && id < 21 && value >= 0 && value <= 255) {
      parameters[id].value = value;
      dmxValues[parameters[id].dmxChannel - 1] = value;
      
      DynamicJsonDocument response(128);
      response["success"] = true;
      response["message"] = "Paramètre mis à jour";
      
      String responseStr;
      serializeJson(response, responseStr);
      webServer.send(200, "application/json", responseStr);
    } else {
      webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Paramètres invalides\"}");
    }
  } else {
    webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Données manquantes\"}");
  }
}

// API: Récupérer les assignations
void handleGetAssignments() {
  Serial.println("🔗 GET /api/assignments - Début");
  
  DynamicJsonDocument doc(512);
  JsonArray assignmentsArray = doc.createNestedArray("assignments");
  
  for (int i = 0; i < 4; i++) {
    assignmentsArray.add(webAssignments[i]);
  }
  
  String response;
  serializeJson(doc, response);
  
  Serial.println("🔗 GET /api/assignments - Réponse envoyée: " + response);
  webServer.send(200, "application/json", response);
}

// API: Mettre à jour les assignations
void handleUpdateAssignments() {
  if (webServer.hasArg("plain")) {
    DynamicJsonDocument doc(512);
    deserializeJson(doc, webServer.arg("plain"));
    
    int index = doc["index"];
    int value = doc["value"];
    
    if (index >= 0 && index < 4 && value >= 0 && value <= 21) {
      webAssignments[index] = value;
      saveWebAssignments();
      
      DynamicJsonDocument response(128);
      response["success"] = true;
      response["message"] = "Assignation mise à jour";
      
      String responseStr;
      serializeJson(response, responseStr);
      webServer.send(200, "application/json", responseStr);
    } else {
      webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Paramètres invalides\"}");
    }
  } else {
    webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Données manquantes\"}");
  }
}

// API: Sauvegarder un preset web
void handleSaveWebPreset() {
  if (webServer.hasArg("plain")) {
    DynamicJsonDocument doc(2048);
    deserializeJson(doc, webServer.arg("plain"));
    
    const char* name = doc["name"];
    JsonArray values = doc["values"];
    
    if (webPresetCount < MAX_WEB_PRESETS && values.size() == 21) {
      strcpy(webPresets[webPresetCount].name, name);
      
      for (int i = 0; i < 21; i++) {
        webPresets[webPresetCount].values[i] = values[i];
      }
      
      webPresetCount++;
      saveWebPresets();
      
      DynamicJsonDocument response(128);
      response["success"] = true;
      response["message"] = "Preset sauvegardé";
      
      String responseStr;
      serializeJson(response, responseStr);
      webServer.send(200, "application/json", responseStr);
    } else {
      webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Impossible de sauvegarder\"}");
    }
  } else {
    webServer.send(400, "application/json", "{\"success\":false,\"message\":\"Données manquantes\"}");
  }
}

